public class 변수04 {
    public static void main(String[] args) {
        //변수의 선언과 값 대입은 동시에 할 수 있다.
        int num;
        num=10;

        int num1=10;
        //변수 선언과 동시에 값을 대입할 수 있다.

        //아래 코드에서 오류가 나는 이유를 생각해보세요.
        //1. 변수의 선언을 반드시 한다.
        //2. 변수를 반드시 초기화(변수에 값을 최초로 대입하는 것) 해야한다.
        //ex)int value;
        //ex)System.out.println("value="+value);

        //정수를 저장할 수 있는 변수
        //x1, y1, z1를 선언.
        int x1, y1, z1;

            //변수명을 결정할 떄의 관례
            //1.변수의 이름은 소문자로 선언한다.
            //2.변수명으로 예약어를 사용할 수는 없다.
            //3.한글로 이름을 선언할 수 있지만 한글은 사용하지 않는다.
            //4.변수의 이름은 직관적으로 판단할 수 있도록 선언하는 것이 좋다.
            //5.특수기호나 숫자는 변수의 첫글자에 사용하지않는다.
            //6.복합어의 변수명을 선언할 떄에는 CamelCase표기법을 사용한다.

        //10

    }
}
